{
  "by" : "avar",
  "id" : 10550581,
  "parent" : 10550438,
  "text" : "This is not a case of there being no applicable law, and some parties doing something obviously sociopathic.<p>I do agree that you can have situations where there&#x27;s no law covering something (because of its novelty etc.) and someone exploits that to their own gain in a way that&#x27;s malicious to society.<p>The tax law is not such a law. There&#x27;s few things that governments put as much effort into as their tax laws. Have you seen the sheer volume of it for most developed states? You could print it out, drop it on someone&#x27;s head from a modest distance and stand a good chance of killing them.<p>What <i>is</i> absurd, and what I&#x27;m objecting to, is that the government clearly knows what it&#x27;s doing with tax law, and what it&#x27;s getting itself into. Yes there will be unintended loopholes, but if they keep getting exploited noticeably year after year without getting closed they&#x27;re not really loopholes are they? They&#x27;re there by design.<p>What various countries in the EU are doing when it comes to their tax rhetoric is absurd and disgusting. Their politicians are badmouthing individuals and specific corporations who are in full compliance with the tax code for not doing their part, while not exercising their power as legislators to actually fix the situation that they&#x27;re complaining about.<p>They&#x27;re doing this because it gains them cheap political points from a certain part of the electorate, while taking money from those same individuals and corporations that are exploiting these &quot;loopholes&quot;.<p>So yes, it is absurd and not morally right. But the politicians are being immoral in singling out individuals in the court of public opinion while making no effort to actually fix the issue, and it&#x27;s absurd that some members of the public are eating up this obvious publicity stunt of theirs.<p>What are you supposed to do as a business owner in this climate of political sniping? Cave in to public opinion and pay higher taxes, and subsequently get replaced by a more tax optimized competitor that doesn&#x27;t pay the same attention to bad press?",
  "time" : 1447289922,
  "type" : "comment"
}
