{
  "by" : "avar",
  "id" : 10581067,
  "parent" : 10580951,
  "text" : "<p><pre><code>    &gt; That seems a very poor and weak definition.\n</code></pre>\nIt&#x27;s not the definition. It&#x27;s my poor recollection of a book I read over a year ago for the purposes of a HN comment. I&#x27;m not trying to establish some all-encompassing holistic definition of morality right here in this comment chain.<p>I&#x27;m just replying to the religious OP (@cmdkeen) that if he&#x27;s interested in what secular people have to say on the subject of morality there&#x27;s a lot written on that subject. I found Sam Harris&#x27;s book on it interesting, but it&#x27;s certainly not the first or the last word on a secular definition of morality.<p>Having said that I&#x27;ll elaborate a bit more on my poor recollection of the book.<p><pre><code>    &gt; 1. It focuses on human as only a human can be happy.\n</code></pre>\nI think for the purposes of the book, yes, but there&#x27;s nothing intrinsic about his idea of morality that&#x27;s isolated to Homo Sapiens. If you wanted to maximize human and canine happiness you could do that too to some degree.<p><pre><code>    &gt; 2. net increase is relative, so this is relative to the author&#x27;s life&#x2F;view of the world.\n    &gt; 3. Well-being doesn&#x27;t mean anything. Does he defines it too?\n</code></pre>\nHe argues that this largely isn&#x27;t the case.<p>The basic idea he&#x27;s putting forth is that there&#x27;s actions you can perform which will make people happy (e.g. being nice to them) and sad (e.g. subjecting them to genocide).<p>Obviously this is not a single-axis spectrum. So he&#x27;s setting forth the argument that happiness can be attained similarly to how we maximize the performance of a hill-climbing algorithm.<p>If we were in real-time able to monitor the net happiness of every human (and also animals, if you insist) and tweak our societies so that net happiness would go up we&#x27;d arrive at a moral society.<p>So thus we can say that some societies are more moral than others. E.g. every modern western state would be morally superior to the Mongol empire by this happiness ratio we can say the society is &quot;better&quot;, and once we have a metric we can work to maximize happiness in our own societies.<p>I think the main hole someone who&#x27;s religious would poke in this would be &quot;but that&#x27;s not morality, you&#x27;re just optimizing for hedonism!&quot;. I think to some degree that&#x27;s true, but from what I&#x27;ve read of secular literature on the subject the idea of &quot;morality&quot; is pretty much discredited.<p>It&#x27;s based on the notion of absolutes, usually handed down by some deity. Once you get rid of that (because deities don&#x27;t exist) what do you replace it with? Some combination of &quot;don&#x27;t do harm&quot; and &quot;let&#x27;s make everyone happy&quot; most likely.",
  "time" : 1447769176,
  "type" : "comment"
}
