{
  "by" : "avar",
  "id" : 10582295,
  "parent" : 10581618,
  "text" : "I&#x27;m just giving you a book recommendation pertinent to your question of how a non-religious person might define &quot;good&quot;.<p>Another commenter in this thread, @marcosscriven, also linked to The God Delusion. It&#x27;s been a while since I read it, but I remember it being quite informative too.<p><pre><code>    &gt; no-one has come up with a good &quot;right&quot; way to\n    &gt; live or act and it is often even harder without\n    &gt; a theist grounding to decide on some pretty major\n    &gt; points.\n</code></pre>\nThis is just something you&#x27;re asserting without arguments. Proponents of secular explanations for &quot;morality&quot; would argue the opposite.<p>There&#x27;s no innate compelling reason for why Reasoning about morality from a theist background would be easier. I think all evidence points to the contrary.<p>Perhaps you disagree with that, but we could have a more interesting discussion if instead of blindly asserting our positions we&#x27;d back them up with some arguments, don&#x27;t you think? :)<p>There are a lot of societies on the planet today that have little to nothing to do with the Judeo-Christian tradition or are otherwise without a scriptural moral tradition.<p>Do you really think those societies or their members are more inherently immoral? At best the idea is naïve, at worst xenophobic and offensive.<p><pre><code>    &gt; Plus going back to burning witches and\n    &gt; stoning homosexuals, really?\n    &gt; [...]\n    &gt; It isn&#x27;t about &quot;cherry picking&quot;.\n    &gt; Different traditions have their basis,\n    &gt; I&#x27;m not sola scriptorum, the CofE believes\n    &gt; in &quot;scripture, reason and tradition&quot;.\n</code></pre>\nI wasn&#x27;t mentioning homosexuals and burning witches to rile you up, but rather as an extreme (but I feel appropriate) example of how much of scripture is at best the source of ambiguous instructions when it comes to moral issues.<p>You&#x27;re quite correct that the moral tradition of Christianity doesn&#x27;t stop at scripture. I&#x27;m not only agreeing with that, but suggesting that that post-scripture process is actually the only relevant process by which we arrive at moral truths.<p>Why is it that we&#x27;ve decided to put more emphasis on some stories in scripture than others? That really is largely a process that can best be described as cherry-picking. How do we decide what to cherry-pick?<p>I think the evidence is clearly on the side of the secular argument that humans are social animals, therefore we need to exist (mostly) peacefully in groups, which gives rise to &quot;moral&quot; principles like not screwing with your neighbor least he screws with you back.<p>Scripture is really just an adaptation of these principles in the form of stories and allegories. Those stories are important to reinforce those ideas in society, but to say that they&#x27;re the primary source is putting the cart before the horse.",
  "time" : 1447779056,
  "type" : "comment"
}
