{
  "by" : "avar",
  "id" : 10715347,
  "parent" : 10715066,
  "text" : "I think you&#x27;re falling for the fallacy of assigning political opinions to a one-dimensional spectrum of liberal v.s. conservative, and doubly so by asserting that your opinion on a given issue can only be caused by being on one end of that spectrum.<p>Even if you assume a one-dimensional political spectrum there&#x27;s plenty of reasons for why someone might by for or against immigration for any number of reasons.<p>For simplicity&#x27;s sake let&#x27;s use the stereotypical US definitions of conservative and liberal, even then you can find plenty of reasons on both sides to be for and against immigration.<p>You could be conservative and be for it because you&#x27;re a business owner and it implies cheap labor, or against it because you&#x27;re also a xenophobe and just don&#x27;t like people from other countries.<p>You could be for it as a liberal because you believe in some pan-nationalistic idea of humanity without borders, or against it because you think the influx of cheap labor will ultimately create a lower class within society which interferes with the project of a socialist state.<p>You mentioned Scotland as an example among the rise of the rise of right-wing ideals in Europe. I think it&#x27;s entirely unrealistic to mention that in the same paragraph as nationalism leading to &quot;massacres, and other oppression&quot;. If anything bad things might happen because Scotland is being denied national autonomy, just look at what&#x27;s been happening in Ireland.<p>Sometimes people just want to do their own thing in their own little piece of the planet. I myself am from Iceland which has a long history of a nationalist movement that has nothing to do with any of that stuff. Sometimes people just want a bit of self-determinism without negatively impacting others. Ascribing that desire to left or right or conservative or liberal is a gross and inaccurate oversimplification.",
  "time" : 1449805896,
  "type" : "comment"
}
