{
  "by" : "avar",
  "id" : 10738050,
  "parent" : 10737620,
  "text" : "I&#x27;ll reply to both this and your downstream comment here for simplicity.<p><pre><code>    &gt; Why do you feel that you _have_ to be able to\n    &gt; correct history? The past is immutable. Fossil\n    &gt; treats it as such.\n</code></pre>\nOpinions differ on what aspect of the past should be made immutable.<p>Should we be recording every single one of your keystrokes in a commit?<p>How about just every time you hit &quot;save&quot; in your editor?<p>Git takes the view that making commits is just like hitting &quot;save&quot; in your editor, it&#x27;s not inherently an operation you want to publish as-is.<p>You can just as well do this with fossil, whatever the tool&#x27;s guarantees of immutability I can always just cp an older version of the directory to get around it and re-do my commits, which on some level is exactly what &quot;git rebase&quot; is doing.<p>Git just makes this process that people have a good reason to do more convenient. Just like I don&#x27;t want to see every single one of your keystrokes or every one of your &quot;save&quot; snapshots when reviewing your code I have no reason to be reading hundreds of your &quot;oops, compilation error&quot; commits.<p>Of course I suspect that you don&#x27;t get much of that with Fossil in the first place, because due to this idealism of immutable history people just aren&#x27;t using the SCM except for &quot;real&quot; work.<p>Which I think sucks, Git has saved me multiple times with some bug I&#x27;ve introduced mid-editing session because I could bisect my 100 &quot;another snapshot&quot; commits, commits that I then subsequently rebased into 1-5 commits and pushed upstream.<p><pre><code>    &gt; Git allows the public record to be flexible forever.\n</code></pre>\nThis is just not <i>at all</i> the case in practice. With Git the difficulty of rewriting history increases as a function of how widely that history is published. Fossil proponents seem to think that established history is being regularly willy-nilly written by projects that use Git.<p>The mainline history of git.git, or linux-2.6.git etc. is not being rewritten and never will.<p>What is being rewritten is locally authored commits that haven&#x27;t been pushed yet, or topic branches that get deleted and replaced by other versions (e.g. with typos fixed in commit messages etc.).<p>You <i>can</i> use Git like Fossil, but most people just choose not to because it doesn&#x27;t make sense.",
  "time" : 1450191557,
  "type" : "comment"
}
