{
  "by" : "avar",
  "id" : 11174458,
  "parent" : 11167390,
  "text" : "<p><pre><code>    &gt; Would the simulated human have real subjective experience? No\n    &gt; way to find out as far as I can tell.\n</code></pre>\nI think that once you hold the view that living beings aren&#x27;t &quot;magic&quot;,\nthat our behavior &#x2F; wants &#x2F; needs are just a result of the sum of our\nhardware as it were, you&#x27;ll quickly realize that talking about &quot;real&quot;\nexperiences doesn&#x27;t make sense.<p>Extrapolating from a simpler system can help to give clarity,\ne.g. does this Lego Robot who&#x27;s running a complete simulation of a\nround worm&#x27;s neural network feel &quot;real&quot; hunger when its food sensory\nneurons are stimulated?<p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=2_i1NKPzbjM\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=2_i1NKPzbjM</a><p>Some might have the knee-jerk reaction of saying something to the effect of &quot;of course it&#x27;s not real, it&#x27;s just a simulation running on some robot, it&#x27;s not actually hungry&quot;.<p>I think that falls apart when you consider the following: Suppose I had the technology to take an existing round worm and slowly replace its individual cells &amp; copmonents with artificial equivalents, at what point would it stop having &quot;real&quot; feelings of hunger or anything else?<p>I think the only sensible answer is to realize that the question doesn&#x27;t make any sense. No more than asserting that moving a computer program from one computer to another makes its execution any less &quot;real&quot;.<p><pre><code>    &gt; You can&#x27;t even find out whether I have true subjective\n    &gt; experience. Maybe I&#x27;m just a machine acting as if I do. So maybe\n    &gt; it&#x27;s a nonsensical question, but I have never found a satisfying\n    &gt; explanation for why exactly it&#x27;s a nonsensical question.\n</code></pre>\nI think if we mapped your entire biology &amp; neural network and uploaded\nit to the proverbial Lego Robot we could easily find out a lot of\nthings about what&#x27;s happening with your experience of the\nworld.<p>E.g. maybe you&#x27;re in chronic pain, maybe you&#x27;re hungry. Those things\nare just the result of biological processes in your body &amp;\nbrain. There&#x27;s no reason to think subjective experience is anything\ninherently different.<p>Edit: Added some clarifications.",
  "time" : 1456409416,
  "type" : "comment"
}
