{
  "by" : "avar",
  "id" : 12642381,
  "parent" : 12641880,
  "text" : "Here&#x27;s the exchange, I found this hard to read without word-wrapping:<p><pre><code>    &gt; On 22 Sep 2016, at 20:27, BITS Security &lt;BITSSecurity at fsroundtable.org&gt; wrote:\n    &gt; \n    &gt; To:  IETF TLS 1.3 Working Group Members\n    &gt; \n    &gt; My name is Andrew Kennedy and I work at BITS, the technology policy\n    &gt; division of the Financial Services Roundtable\n    &gt; (http:&#x2F;&#x2F;www.fsroundtable.org&#x2F;bits).  My organization represents\n    &gt; approximately 100 of the top 150 US-based financial services\n    &gt; companies including banks, insurance, consumer finance, and asset\n    &gt; management firms.\n    &gt;\n    &gt; I manage the Technology Cybersecurity Program, a CISO-driven forum\n    &gt; to investigate emerging technologies; integrate capabilities into\n    &gt; member operations; and advocate member, sector, cross-sector, and\n    &gt; private-public collaboration.\n    &gt;\n    &gt; While I am aware and on the whole supportive of the significant\n    &gt; contributions to internet security this important working group has\n    &gt; made in the last few years I recently learned of a proposed change\n    &gt; that would affect many of my organization&#x27;s member institutions: the\n    &gt; deprecation of RSA key exchange.\n    &gt;\n    &gt; Deprecation of the RSA key exchange in TLS 1.3 will cause\n    &gt; significant problems for financial institutions, almost all of whom\n    &gt; are running TLS internally and have significant, security-critical\n    &gt; investments in out-of-band TLS decryption.\n    &gt;\n    &gt; Like many enterprises, financial institutions depend upon the\n    &gt; ability to decrypt TLS traffic to implement data loss protection,\n    &gt; intrusion detection and prevention, malware detection, packet\n    &gt; capture and analysis, and DDoS mitigation.  Unlike some other\n    &gt; businesses, financial institutions also rely upon TLS traffic\n    &gt; decryption to implement fraud monitoring and surveillance of\n    &gt; supervised employees.  The products which support these capabilities\n    &gt; will need to be replaced or substantially redesigned at significant\n    &gt; cost and loss of scalability to continue to support the\n    &gt; functionality financial institutions and their regulators require.\n    &gt;\n    &gt; The impact on supervision will be particularly severe.  Financial\n    &gt; institutions are required by law to store communications of certain\n    &gt; employees (including broker&#x2F;dealers) in a form that ensures that\n    &gt; they can be retrieved and read in case an investigation into\n    &gt; improper behavior is initiated.  The regulations which require\n    &gt; retention of supervised employee communications initially focused on\n    &gt; physical and electronic mail, but now extend to many other forms of\n    &gt; communication including instant message, social media, and\n    &gt; collaboration applications.  All of these communications channels\n    &gt; are protected using TLS.\n    &gt;\n    &gt; The impact on network diagnostics and troubleshooting will also be\n    &gt; serious.  TLS decryption of network packet traces is required when\n    &gt; troubleshooting difficult problems in order to follow a transaction\n    &gt; through multiple layers of infrastructure and isolate the fault\n    &gt; domain.  The pervasive visibility offered by out-of-band TLS\n    &gt; decryption can&#x27;t be replaced by MITM infrastructure or by endpoint\n    &gt; diagnostics.  The result of losing this TLS visibility will be\n    &gt; unacceptable outage times as support groups resort to guesswork on\n    &gt; difficult problems.\n    &gt;\n    &gt; Although TLS 1.3 has been designed to meet the evolving security\n    &gt; needs of the Internet, it is vital to recognize that TLS is also\n    &gt; being run extensively inside the firewall by private enterprises,\n    &gt; particularly those that are heavily regulated.  Furthermore, as more\n    &gt; applications move off of the desktop and into web browsers and\n    &gt; mobile applications, dependence on TLS is increasing.\n    &gt;\n    &gt; Eventually, either security vulnerabilities in TLS 1.2, deprecation\n    &gt; of TLS 1.2 by major browser vendors, or changes to regulatory\n    &gt; standards will force these enterprises - including financial\n    &gt; institutions - to upgrade to TLS 1.3.  It is vital to financial\n    &gt; institutions and to their customers and regulators that these\n    &gt; institutions be able to maintain both security and regulatory\n    &gt; compliance during and after the transition from TLS 1.2 to TLS 1.3.\n    &gt;\n    &gt; At the current time viable TLS 1.3-compliant solutions to problems\n    &gt; like DLP, NIDS&#x2F;NIPS, PCAP, DDoS mitigation, malware detection, and\n    &gt; monitoring of regulated employee communications appear to be\n    &gt; immature or nonexistent.  There are serious cost, scalability, and\n    &gt; security concerns with all of the currently proposed alternatives to\n    &gt; the existing out-of-band TLS decryption architecture:\n    &gt;\n    &gt; - End point monitoring: This technique does not replace the\n    &gt;   pervasive network visibility that private enterprises will lose\n    &gt;   without the RSA key exchange.  Ensuring that every endpoint has a\n    &gt;   monitoring agent installed and functioning at all times is vastly\n    &gt;   more complex than ensuring that a network traffic inspection\n    &gt;   appliance is present and functioning.  In the case of monitoring\n    &gt;   of supervised employee communications, moving the monitoring\n    &gt;   function to the endpoint raises new security concerns focusing on\n    &gt;   deliberate circumvention - because in the supervision use case\n    &gt;   the threat vector is the possessor of the endpoint.\n    &gt;\n    &gt; - Exporting of ephemeral keys: This solution has scalability and\n    &gt;   security problems on large, busy servers where it is not possible\n    &gt;   to know ahead of time which session is going to be the important\n    &gt;   one.\n    &gt;\n    &gt; - Man-in-the-middle: This solution adds significant latency, key\n    &gt;   management complexity, and production risk at each of the needed\n    &gt;   monitoring layers.\n    &gt;\n    &gt; Until the critical concerns surrounding enterprise security,\n    &gt; employee supervision, and network troubleshooting are addressed as\n    &gt; effectively as internet MITM and surveillance threats have been, we,\n    &gt; on behalf of our members, are asking the TLS 1.3 Working Group to\n    &gt; delay Last Call until a workable and scalable solution is identified\n    &gt; and vetted, and ultimately adopted into the standard by the TLS 1.3\n    &gt; Working Group.\n    &gt;\n    &gt; Sincerely,\n    &gt; \n    &gt; Andrew Kennedy\n    &gt; Senior Program Manager, BITS\n</code></pre>\nThe reply:<p><pre><code>    To: BITS Security &lt;BITSSecurity at fsroundtable.org&gt;\n    Subject: Re: [TLS] Industry Concerns about TLS 1.3\n    From: &quot;Paterson, Kenny&quot; &lt;Kenny.Paterson at rhul.ac.uk&gt;\n    Date: Thu, 22 Sep 2016 19:14:25 +0000\n    [...]\n\n    Hi Andrew,\n    \n    My view concerning your request: no.\n    \n    Rationale: We&#x27;re trying to build a more secure internet.\n    \n    Meta-level comment:\n    \n    You&#x27;re a bit late to the party. We&#x27;re metaphorically speaking at the\n    stage of emptying the ash trays and hunting for the not quite empty\n    beer cans.\n    \n    More exactly, we are at draft 15 and RSA key transport disappeared\n    from the spec about a dozen drafts ago. I know the banking industry is\n    usually a bit slow off the mark, but this takes the biscuit.\n    \n    Cheers,\n    \n    Kenny</code></pre>",
  "time" : 1475656874,
  "type" : "comment"
}
