{
  "by" : "avar",
  "id" : 13043744,
  "kids" : [ 13043890, 13044293, 13044391, 13044104, 13045426, 13043849, 13043802 ],
  "parent" : 13043423,
  "text" : "NPR has a recent podcast called &quot;The No-Brainer Economic Platform&quot; which includes changes to the tax codes that have a unanimous approval of economists across the political spectrum (e.g. abolishing corporate tax), but which they show via focus groups would be impossible to present to the public:<p><a href=\"http:&#x2F;&#x2F;www.npr.org&#x2F;sections&#x2F;money&#x2F;2016&#x2F;10&#x2F;26&#x2F;499490275&#x2F;episode-387-the-no-brainer-economic-platform\" rel=\"nofollow\">http:&#x2F;&#x2F;www.npr.org&#x2F;sections&#x2F;money&#x2F;2016&#x2F;10&#x2F;26&#x2F;499490275&#x2F;episo...</a><p>Their other plans include things like abolishing housing and medical subsidies, which they claim just leads to price inflation in the longer term, but which are obvious political suicides to propose.<p>A text summary of the podcast is available at: <a href=\"http:&#x2F;&#x2F;www.npr.org&#x2F;sections&#x2F;money&#x2F;2012&#x2F;07&#x2F;19&#x2F;157047211&#x2F;six-policies-economists-love-and-politicians-hate\" rel=\"nofollow\">http:&#x2F;&#x2F;www.npr.org&#x2F;sections&#x2F;money&#x2F;2012&#x2F;07&#x2F;19&#x2F;157047211&#x2F;six-p...</a><p>They did a follow-up episode where they hired an actor to play a politician advocating these policies, and tried to convince focus groups of voters:<p><a href=\"http:&#x2F;&#x2F;www.npr.org&#x2F;sections&#x2F;money&#x2F;2016&#x2F;11&#x2F;02&#x2F;500413695&#x2F;episode-413-our-fake-candidate-meets-the-people\" rel=\"nofollow\">http:&#x2F;&#x2F;www.npr.org&#x2F;sections&#x2F;money&#x2F;2016&#x2F;11&#x2F;02&#x2F;500413695&#x2F;episo...</a><p>The point of these episodes was not to try to present some absolute truth about economic policies, but rather to demonstrate that while there are certain things experts universally or near-universally agree on, convincing voters of these policies can be a hard sell.<p>E.g. they argue that eliminating mortgage tax deduction would have the counter-intuitive long-term benefit of making houses more affordable. But when you try to explain that to people you&#x27;ve lost most of them once they realize that in the shorter term their existing mortgage would go up.",
  "time" : 1480171799,
  "type" : "comment"
}
