{
  "by" : "avar",
  "id" : 13239481,
  "kids" : [ 13239510 ],
  "parent" : 13239135,
  "text" : "Your paraphrasing of Feynman&#x27;s bridge quote is inaccurate. From\nAppendix F[1] of the report:<p><pre><code>    [..]  In spite of these variations from case to case, officials behaved as\n    if they understood it, giving apparently logical arguments to each\n    other often depending on the &quot;success&quot; of previous flights. For\n    example. in determining if flight 51-L was safe to fly in the face of\n    ring erosion in flight 51-C, it was noted that the erosion depth was\n    only one-third of the radius. It had been noted in an experiment\n    cutting the ring that cutting it as deep as one radius was necessary\n    before the ring failed. Instead of being very concerned that\n    variations of poorly understood conditions might reasonably create a\n    deeper erosion this time, it was asserted, there was &quot;a safety factor\n    of three.&quot; This is a strange use of the engineer&#x27;s term ,&quot;safety\n    factor.&quot; If a bridge is built to withstand a certain load without the\n    beams permanently deforming, cracking, or breaking, it may be designed\n    for the materials used to actually stand up under three times the\n    load. This &quot;safety factor&quot; is to allow for uncertain excesses of load,\n    or unknown extra loads, or weaknesses in the material that might have\n    unexpected flaws, etc. If now the expected load comes on to the new\n    bridge and a crack appears in a beam, this is a failure of the\n    design. There was no safety factor at all; even though the bridge did\n    not actually collapse because the crack went only one-third of the way\n    through the beam. The O-rings of the Solid Rocket Boosters were not\n    designed to erode. Erosion was a clue that something was wrong.\n    Erosion was not something from which safety can be inferred.\n</code></pre>\nHis point about NASA&#x27;s nonsensical use of the &quot;safety factor&quot; is not that you could drive over a bridge, and look, it didn&#x27;t break, so it must be OK!<p>It&#x27;s even worse, you drive a truck over it, afterwards 1&#x2F;3 of the steel is cracked, so you conclude that it must be able to safely accept 3x the weight. Nonesense! This is the sort of moronic engineering that killed the crew of the Challenger.<p>1. <a href=\"http:&#x2F;&#x2F;science.ksc.nasa.gov&#x2F;shuttle&#x2F;missions&#x2F;51-l&#x2F;docs&#x2F;rogers-commission&#x2F;Appendix-F.txt\" rel=\"nofollow\">http:&#x2F;&#x2F;science.ksc.nasa.gov&#x2F;shuttle&#x2F;missions&#x2F;51-l&#x2F;docs&#x2F;roger...</a>",
  "time" : 1482433269,
  "type" : "comment"
}
