{
  "by" : "avar",
  "id" : 13272803,
  "kids" : [ 13273411 ],
  "parent" : 13271397,
  "text" : "&gt; I&#x27;ve been clear about my meaning. Can&#x27;t simplify it any further.<p>You really haven&#x27;t. This entire thread is you taking disposablezero&#x27;s &quot;Relying on error-prone, distracted, slow humans to guide massive killing machines is playing Russian roulette&quot; comment out of context as some moral statement about human beings.<p>There&#x27;s a bunch of things humans are worse at than machines, you&#x27;re the only one asserting that this somehow &quot;devalues&quot; people without any further clarification.<p>I&#x27;m also worse at shoving nails into wood than a hammer is. How does that devalue me?<p>&gt; [Because certain types of technical advancement requires an element of devaluing people]. That&#x27;s your quote. What did you mean?<p>The set of things machines are better at than humans is only increasing over time. Today nobody disputes that a combine harvester is better for the task than a team of humans, but there&#x27;s a tendency to overvalue human work as machines are getting better.<p>I&#x27;ve noticed that changing with &quot;handmade&quot; within my lifetime, and we&#x27;re probably about to see it change with &quot;human-driven vehicle&quot; within the next decade.<p>&gt; There&#x27;s a difference between preferring tech to do the driving and saying the human has &quot;less value&quot;. You don&#x27;t see that?<p>No, I really don&#x27;t. You haven&#x27;t defined what you&#x27;re talking about when you&#x27;re saying &quot;value&quot; or &quot;devalue&quot;, but I will. I&#x27;m talking about value in the economic sense. I.e. if you&#x27;ve made a combine harvester instead of needing 50 people to do manual labor for 16 hours a day you&#x27;ve optimized your economy and added net value to our civilization.<p>I really don&#x27;t buy this argument that saying a human has less value is a negative. The logical conclusion to that argument is saying that we should unwind civilization and technological advancements until we&#x27;re all hunter-gatherers again. Because surely the existence of the food industry devalues hunters everywhere.<p>&gt; In any case, a hostile regard for human fallibility that approaches promotion of the dispensability of humans isn&#x27;t a good thing.<p>No, it&#x27;s the exact opposite. It&#x27;s saying that we shouldn&#x27;t waste a human being&#x27;s potential on some menial task like manually picking corn in a field or driving a car.<p>To someone living in the future we&#x27;re hopefully heading towards the notion of someone needing to make driving a vehicle their full-time job will be as ridiculous as the notion of of a human being needing to manually carry freight is today, as opposed to using a truck.",
  "time" : 1482952360,
  "type" : "comment"
}
