{
  "by" : "avar",
  "id" : 13417301,
  "kids" : [ 13419547 ],
  "parent" : 13416439,
  "text" : "&gt; GMOs just make it faster.<p>No, GMOs will inherently change the game in the long term. We&#x27;ll be able to truly engineer life to be an optimal food supply, e.g. there&#x27;s no inherent reason there can&#x27;t be a plant that can sit in your window, withstand freezing temperatures, and grow both tomatoes, avocados and bananas.<p>Some versions of this are already happening with GMO food, they&#x27;re surgically introducing features to these plants that wouldn&#x27;t be doable with just mutation farming.<p>&gt; I can&#x27;t see a combine getting up there, can you?<p>No, but that was my point. The author of the article is railing against industrialized farming and then producing a counterexample of some farm in Austria that clearly isn&#x27;t and can&#x27;t be mechanized easily. That&#x27;s clearly not something you can use as a rebuke to current industrialized farming, one feeds the world, another is a backyard hobby project.<p>&gt; They can&#x27;t afford mechanisation, so have to manually plough and weed[...]<p>Yes, and the solution to this is to enrich their societies, starting with the introduction of modern farming practices. No need to start doing something revolutionary we haven&#x27;t tried in the west, just introduce them to mechanized farming.<p>&gt; Yes, they can be more drought resistant, but why are there droughts? [...]<p>Even if we perfectly manage everything else GMOs would still be a great tool to expand the use of our land for farming. E.g. you could grow some cactus in the middle of the Sahara that was easily edible.<p>&gt; Farming is fucking complex, I&#x27;d suggest you go and work on a permaculture and &quot;modern&quot; farm, to see just what&#x27;s required.<p>And I suggest that if you&#x27;re trying to make some point here about some hidden knowledge I&#x27;m obviously missing and could only acquire through hands-on experience you just come out and point that out, rather than effectively make an ad-hominem argument by proxy.",
  "time" : 1484659825,
  "type" : "comment"
}
