{
  "by" : "avar",
  "id" : 13694829,
  "kids" : [ 13695056, 13695540, 13697819 ],
  "parent" : 13694216,
  "text" : "[Book &amp; movie spoilers galore]<p>As this article points out, referring to Louise being able to see the\nfuture in the book:<p><pre><code>    &gt; &quot;she is like an actor following a script, engaged in a\n    &gt; self-fulfilling prophecy, taking precisely the actions\n    &gt; necessary to bring about the future she sees. A\n    &gt; fictional example of this would be Paul Atreides in\n    &gt; Dune Messiah, whose prescience allows him to see\n    &gt; visions of the present and act despite being blind -\n    &gt; but only as long as he executes the actions which\n    &gt; bring about the vision, thereby keeping the visions\n    &gt; reflective of reality.&quot;\n</code></pre>\nHowever, in the book her daughter dies in a climbing accident, not\nfrom disease. The underlying point of the book as I read it is that\nfree will doesn&#x27;t exist and we&#x27;re all just helpless pawns doomed to\nplay out the inevitable.<p>Reportedly Hollywood didn&#x27;t like that interpretation, so instead her\ndaughter dies from disease, so the movie doesn&#x27;t have to explain why\nLouise can&#x27;t just tell her daughter &quot;JUST DON&#x27;T EVER GO CLIMBING\nYOU&#x27;LL DIE I CAN SEE THE GODDAMN FUTURE!&quot;.<p>I think as a result the movie really makes no sense. Seeing the future\ncan really only make sense if events are either determinate or you\ncan&#x27;t or are unwilling to change them. Otherwise you wouldn&#x27;t know\nwhat future you&#x27;re seeing or how your actions would impact the future.<p>In a universe where you can alter the future her vision of General\nShang at the end of the movie doesn&#x27;t make any sense. How can she see\nwhat General Shang told her in the future, if the only reason he told\nher is because of information Shang sent to her from the future as a\nresult of her current actions, which are only possible due to\ninformation Shang sent her from the future?<p>In the book it&#x27;s not as if Louise sees a way to save all humanity and\nhas to make the hard choice to follow that path like Paul Atreides in\nDune. She just sees things pertaining to her family life, in\nparticular that her daughter eventually dies in an entirely\npreventable climbing accident.<p>So there you go, a movie that really makes no sense, although they had\nthe good sense to plaster over the more obvious plot hole with her\ndaughter now that free will is a thing by making her die from an\nincurable disease instead.",
  "time" : 1487676968,
  "type" : "comment"
}
