{
  "by" : "avar",
  "id" : 13991350,
  "kids" : [ 13991411, 13992596, 13993771, 13991527, 13991740, 13992148, 13992240, 13994340, 13992472, 13992075, 13992636, 13996337, 13992595, 13992196, 13994953, 13993171, 13992655, 13994910, 13993183, 13991942 ],
  "parent" : 13990391,
  "text" : "This whole thread is full of comments from people who obviously haven&#x27;t read the article &#x2F; listened to the podcast in question[1].<p>Joseph Bankman proposed ReadyReturn in California, which is the kind of tax return pretty much the entirety of the rest of the western world uses. I.e. instead of an empty return, it&#x27;s pre-filled in with the details the government knows anyway. This vastly simplifies things for most people, especially those whose main income comes from working one job.<p>This was in no way a change to the tax system, or what taxes people had to pay. The government would just hand you a filled-in form instead of an empty one, so you could make corrections instead of filling it in from scratch.<p>It had north of 99% approval ratings by the people in the test groups for it, something unheard of when it comes to government programs.<p>As a parlor trick Bankman would carry around a thick binder with the feedback the program had received from taxpayers. When he wanted to convince someone he&#x27;d start paging through it and ask the person he was talking to to say &quot;stop&quot;, to ensure he wasn&#x27;t cherry-picking. He&#x27;d then start reading raving reviews of the program starting at that page, some in all-caps from people who couldn&#x27;t contain their excitement.<p>It didn&#x27;t make it into law, partly due to lobbying by the likes of Intuit, but more interestingly, I thought, because Grover Norquist, the well known promoter of the &quot;Taxpayer Protection Pledge&quot; took the counterintuitive view that just making the process easier equated to a new tax, since taxpayers might end up paying taxes <i>already</i> on the books that they might have previously unintentionally evaded.<p>That to me is the most bizarre detail about this entire story. It&#x27;s likely that it would have passed if not for the strange interpretation of one man to this not-a-new-tax of it effectively being a new tax, and his ability to sway the Republicans due to the political power his &quot;Taxpayer Protection Pledge&quot; holds over Republicans.<p>1. <a href=\"http:&#x2F;&#x2F;www.npr.org&#x2F;sections&#x2F;money&#x2F;2017&#x2F;03&#x2F;22&#x2F;521132960&#x2F;episode-760-tax-hero\" rel=\"nofollow\">http:&#x2F;&#x2F;www.npr.org&#x2F;sections&#x2F;money&#x2F;2017&#x2F;03&#x2F;22&#x2F;521132960&#x2F;episo...</a>",
  "time" : 1490827847,
  "type" : "comment"
}
