{
  "by" : "avar",
  "id" : 14034976,
  "kids" : [ 14040552 ],
  "parent" : 14034308,
  "text" : "You&#x27;re misreading the graph[1]. The 2-7 grouping is all gun deaths, homicides, suicides, and accidental deaths.<p>If you hover over individual blue counties you can see the breakdown by homicide and suicide rate for some of them.<p>E.g. Washington, NY has a gun homicide rate of 0.46, gun suicide rate of 5.14. Meanwhile The Netherlands has a gun homicide rate of 0.29, gun suicide rate of 0.28, but an overall homicide rate of 0.7[2], and an overall suicide rate of 8.2, while the US has a suicide rate of 12.1.<p>Does The Netherlands still come out better? Am I cherry-picking by comparing county-level statistics v.s. entire countries? Yes and yes.<p>But for the point I&#x27;m making it doesn&#x27;t matter. The point is that there&#x27;s a common misunderstanding, particularly among mainland Europeans, that the mere availability of guns in the US results in a drastic increase in the homicide rate.<p>This is simply not supported by the data. What the data <i>does</i> show is that if you&#x27;re going to kill yourself or others you&#x27;re likely to use the best tool for the task, whether that&#x27;s a gun or a knife.<p>Does the ease of availability of guns in the US make it easier to kill people, and cause some murders that otherwise wouldn&#x27;t have happened? Yeah, but it&#x27;s hard to tease that out of the data, it also prevents some murders.<p>What we do see from the data[2] is that there&#x27;s lots of countries with much more restrictive gun policies that have higher homicide rates than the US, and furthermore the occurrences of gun-related homicides in the US don&#x27;t at all map to whether the area has more liberal access to guns, but whether there&#x27;s a general crime &amp; poverty problem there.<p>Lithuania has a significantly higher homicide rate than the US, 5.5 v.s. the US&#x27;s 3.9, but just 1% of homicides there are gun crimes[3].<p>However I&#x27;ve never heard anyone say to my Lithuanian friends that they were lucky to get out because of the obscene murder rate there, but I&#x27;ve heard my fellow Europeans make comments like that to some of my American friends when it comes to gun crimes.<p>1. <a href=\"http:&#x2F;&#x2F;projects.oregonlive.com&#x2F;ucc-shooting&#x2F;gun-deaths\" rel=\"nofollow\">http:&#x2F;&#x2F;projects.oregonlive.com&#x2F;ucc-shooting&#x2F;gun-deaths</a><p>2. <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_countries_by_intentional_homicide_rate\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_countries_by_intention...</a><p>3. <a href=\"https:&#x2F;&#x2F;www.gunpolicy.org&#x2F;firearms&#x2F;citation&#x2F;quotes&#x2F;10319\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gunpolicy.org&#x2F;firearms&#x2F;citation&#x2F;quotes&#x2F;10319</a>",
  "time" : 1491325839,
  "type" : "comment"
}
