{
  "by" : "avar",
  "id" : 14041047,
  "kids" : [ 14042115 ],
  "parent" : 14040552,
  "text" : "This reply is correctly refuting an argument that I&#x27;m not making. If I was saying that the gun homicide rate anywhere in the EU &amp; the US was comparable I&#x27;d be wrong, as you say it&#x27;s off by orders of magnitude.<p>What I <i>am</i> saying is that comparing homicides by weapon type ignores the big picture, which is <i>who cares</i> in the end whether you&#x27;re killed by a gun, a knife, or bludgeoned to death? You&#x27;re going to be just as dead.<p>The availability of guns in the US means that when there&#x27;s a homicide or a suicide it&#x27;s vastly more likely to involve a gun than in the EU, but people focus on that statistic and assume that magically taking away the guns would drastically improve the situation.<p>That&#x27;s not supported by the data. The people of Lithuania, which for some in the US would match some ideal they have of restrictive gun laws, manage to kill each other at a higher overall rate than pepole in the US, even though they have gun restrictions to the point where only 1% of those homicides involve a gun.<p>So yes, if you look at the US by firearm related death rate[1] alone it looks like a 3rd world hellhole. But comparing countries by death rate by specific implement makes no sense. Instead you have to look at the overall homicide rate[2] and the overall suicide rate[3].<p>Once you do that, several countries in Europe look worse when it comes to homicides, and the US is exceeded by the likes of France when it comes to overall suicide rates.<p>1. <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_countries_by_firearm-related_death_rate\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_countries_by_firearm-r...</a><p>2. <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_countries_by_intentional_homicide_rate\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_countries_by_intention...</a><p>3. <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_countries_by_suicide_rate\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_countries_by_suicide_r...</a>",
  "time" : 1491388043,
  "type" : "comment"
}
