{
  "by" : "avar",
  "id" : 14177984,
  "kids" : [ 14188615, 14178380 ],
  "parent" : 14177811,
  "text" : "I think that&#x27;s an absurdly low standard to apply to corporate speech.<p>The CEO of a multi-billion dollar company gets on stage during their main annual product conference and says a newly announced product is going to become an open industry standard.<p>This turns out not to possible in exactly the way the company had planned due to a lawsuit, so the company drops the plan entirely.<p>That&#x27;s a lie by definition. You asserted that you&#x27;d do something and then you didn&#x27;t do it. Does breaking a promise imply that there can&#x27;t be any mitigating circumstances? No, I&#x27;m sure there were some reasons for why FaceTime wasn&#x27;t opened.<p>People &amp; companies make product buying decisions based on things like these, e.g. some company might have bought a bunch of iPads for video conferencing expecting that in a couple of years they&#x27;d be inter-operable with any device they could buy, including non-Apple devices.<p>This excuse that they couldn&#x27;t open the p2p thing they initially planned to open is absurd. Apple could absolutely have just opened &amp; standardized what FaceTime ended up being, i.e. an open video chat client&#x2F;server allowing anyone to run a server. I.e. some sort of IRC or Jabber for video messaging.<p>Even if they couldn&#x27;t open or release some specific component due to patent concerns they could still have opened &amp; standardized almost everything else, see e.g. how open source video players ship pluggable codec support without direct support for some proprietary &amp; patented codecs.<p>Bringing this back to my original comment on APFS, do I think they won&#x27;t open that? No, they probably will. I just thought I&#x27;d point out that Apple has a documented history of abandoning their open source &#x2F; standardization plans after making some <i>very</i> public announcements about them, so people should be wary of counting their chickens before they&#x27;re hatched when it comes to Apple.",
  "time" : 1492952460,
  "type" : "comment"
}
