{
  "by" : "avar",
  "id" : 14205447,
  "kids" : [ 14205723, 14206819, 14209677, 14207163, 14206156, 14205537, 14208979, 14205843, 14205482, 14205818, 14209043, 14208005, 14210044, 14209765, 14206291, 14208400, 14210105, 14205530, 14209371, 14207721, 14210082, 14207803, 14206768 ],
  "parent" : 14204702,
  "text" : "<p><pre><code>    &gt; Unfortunately, in many places, it’s not\n    &gt; feasible to lay down sewer pipes or build\n    &gt; treatment facilities. [...] But giving\n    &gt; people access to toilets isn’t enough. You\n    &gt; also have to persuade them to use the\n    &gt; toilets.\n</code></pre>\nI can&#x27;t find it now, but there was a news video making the rounds a year or two ago that showed that this problem is much more fundamental than that.<p>It showed a Indians in a tiny village who were falling ill because they were literally taking a shit in the same river that they were getting their drinking water from, just a few meters away.<p>These people all knew each other, and even if they didn&#x27;t have any toilets or basic infrastructure I would have thought that something as basic as &quot;if you shit where you drink, you get cholera&quot; would be common knowledge anywhere in the world by now.<p>Of course it would have been nice for those people to have sewer pipes, toilets etc. But in that case the problem could have been solved with a few shovels, and a marked area indicating where you should be going to do your business, preferable in some open field far from the drinking water.<p>For those people toilets would be nice, but unnecessary. They clearly all have a shared interest in not drinking each other&#x27;s shit. If by some magic they aren&#x27;t aware that mixing shit with water leads to bad consequences that seemed to be solvable by some one-time government presentation on the consequences of them keeping doing what they were doing.<p>But somehow the problem persists, it&#x27;s unbelievable.",
  "time" : 1493230069,
  "type" : "comment"
}
