{
  "by" : "avar",
  "id" : 14232799,
  "kids" : [ 14233086, 14233177, 14233739, 14233079, 14233136 ],
  "parent" : 14232629,
  "text" : "Any free or open source software license does not need an EULA, and presenting it as such is antithetical to the entire idea of free software.<p>You by definition do not need to agree to any free software license before you use the software, you can vehemently disagree with it or completely ignore its existence.<p>The license only exists to give you <i>extra</i> rights you didn&#x27;t already have under standard copyright law (permission to distribute the program &amp; modify it, under certain conditions).<p>An EULA is a dubious legal hack used by proprietary software to deprive you of rights you&#x27;d have had anyway if not for the EULA, which is the exact opposite of how free software works.<p>Edit: A lot of people are replying to this saying I&#x27;m incorrect. I&#x27;m not. A lot of free software licenses such as the GPL v2 spell out explicitly that they have nothing to do with anything except copying&#x2F;distribution or modification:<p><pre><code>    &gt; Activities other than copying, distribution\n    &gt; and modification are not covered by this License;\n    &gt; they are outside its scope.[...]\n</code></pre>\nThe GPL v3 says the same thing in different words, and as FigBug points out downthread the general FSF license FAQ makes this clear[1].<p>The Open Source definition also asserts this by proxy. Licenses aren&#x27;t allowed to impose any restrictions on users that they wouldn&#x27;t have anyway if they had no license to the software.<p>Really, if you use free software you can just completely ignore all the licenses and you don&#x27;t need to understand or have read any of them. This is one of the beautiful things about free software that separates it from EULA-using proprietary software.<p>Of course you need to understand the licenses if you want to distribute the software in any way, but that entirely falls under the umbrella of activity you didn&#x27;t have permission for without the license, it would be copyright infringement by default.<p>This is also why free software organizations like the FSF would as a last resort sue someone for copyright infringement, not violating the GPL (but of course adhering to the GPL would bring them back into compliance).<p>This is different from proprietary software companies which might sue you over violations of their own made up rules, which you supposedly agreed to via the EULA.<p>The EULA is a hack to try to apply contract law to your use of the program, whereas free software &amp; open source licenses purely piggy-back on copyright law.<p>All those licenses are a way to say &quot;here&#x27;s stuff we allow you to do, which you didn&#x27;t have legal permission to do anyway in the absence of this license, given certain conditions&quot; (or no conditions for e.g. the WFTPL).<p>1. <a href=\"https:&#x2F;&#x2F;www.gnu.org&#x2F;licenses&#x2F;gpl-faq.en.html#NoDistributionRequirements\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gnu.org&#x2F;licenses&#x2F;gpl-faq.en.html#NoDistributionR...</a>",
  "time" : 1493574309,
  "type" : "comment"
}
