{
  "by" : "avar",
  "id" : 14241194,
  "kids" : [ 14241290 ],
  "parent" : 14240354,
  "text" : "<p><pre><code>    &gt; Are you missing the difference between\n    &gt; distributing the program and distributing\n    &gt; its result? The latter lands firmly into\n    &gt; &quot;usage&quot; category. [...] it&#x27;s like saying if\n    &gt; I send somebody a Word document it&#x27;s the\n    &gt; same as if I sent them a copy of\n    &gt; Word. That&#x27;s baloney.\n</code></pre>\nThe AGPL is meant to cover the cases where the &quot;output&quot; is what the\nprogram itself <i>does</i>. E.g. free software web applications like bug\ntrackers, wikis etc.<p>So the analogy is not sending someone a Word document being like\ndistributing Word, neither the APGL or the GPL cover that. It&#x27;s\nsetting up a paid-for VNC service where users can access <i>your</i> copy of Word.<p>The GPL explicitly permits this sort of thing, because it&#x27;s quite lax\nabout defining network interaction, the AGPL is more strict.<p><pre><code>    &gt; Again, only if &quot;user&quot; means &quot;never modifying\n    &gt; or building on it&quot;, which in OSS world is a\n    &gt; very restrictive condition.\n</code></pre>\nCopyright law has no purview over whether you modify or build on\nsomething, and neither can any free software license. I can modify and\nbuild on any software I have that I haven&#x27;t signed a contract to\nobtain, copyright law only comes into play when I want to <i>distribute</i>\nthe software in any way.<p>If and when I&#x27;ve done that whether I&#x27;ve modified or built on it has\nlittle bearing on whether I&#x27;m committing copyright infringement.<p><pre><code>    &gt; Did you just claim &quot;following standard\n    &gt; copyright law&quot; and &quot;ignoring the license&quot; is\n    &gt; the same and both things are easy and\n    &gt; obvious?\n</code></pre>\nI really can&#x27;t see how you&#x27;ve read this thread and somehow become this\nconfused. All I&#x27;m doing here is correcting WBrentWilliams&#x27;s\nmisconception that free software licenses are somehow something you\nneed to get end-users to agree to before they use freely licensed\nsoftware.<p>That this isn&#x27;t how things work is something the GPL itself explicitly states. The same\napplies to any free software license, the GPL just happens to be a\nrather verbose license which goes out of its way to explain the basics\nof copyright law to you.",
  "time" : 1493670278,
  "type" : "comment"
}
