{
  "by" : "avar",
  "id" : 14438278,
  "parent" : 14437642,
  "text" : "You don&#x27;t need to trust everyone to hold to hashrate limitations, you have a closed network, you just need the majority of participants on the network to agree kick out any violators.<p>Here&#x27;s an article describing how the majority of hashrate was reversed once for Bitcoin itself:<p><a href=\"https:&#x2F;&#x2F;bitcoinmagazine.com&#x2F;articles&#x2F;bitcoin-network-shaken-by-blockchain-fork-1363144448&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;bitcoinmagazine.com&#x2F;articles&#x2F;bitcoin-network-shaken-...</a><p>The largest miners all agreed to switch to the 0.7 chain, even though the 0.8 chain had more CPU power. This could just as well have been done on a closed bank network by e.g. everyone agreeing that Deutsche Bank are being dicks and trying to take over the network, and simply manually ignoring what they&#x27;re mining.<p>If you&#x27;re one of 10 miners on a closed network and you know the other 9 will simply start ignoring you if you break the rules, you don&#x27;t have any incentive to break the rules.<p>You also haven&#x27;t come up with any plausible scenario for why one bank would even bother to do this. If you&#x27;re using a private blockchain for e.g. a SWIFT replacement as discussed in this thread, what&#x27;s Deutsche Bank going to do once they become dicks and acquire 99.9% of the mining power? Disproportionately pay for running the whole thing? They don&#x27;t have any interest either in screwing up the network or approving double-spending or whatever, since they&#x27;re also using this SWIFT-replacement just like everyone else is.<p>Claiming that this is &quot;useless&quot; in &quot;a world with off-site replication of databases&quot; is missing the point. You&#x27;re just failing to imagine that there can be anything on the spectrum betweeen a 100% centralized system with 100% trust and a  100% decentralized system with 0% trust.<p>How is a group of 10 banks who needs a SWIFT-like system going to run a traditional DB with off-site replicas, say the primary fails, which replica run by the 10 banks does everyone agree to fail over to? You&#x27;ll very quickly just need some centralized party to run the whole thing at a large cost, and you&#x27;ll end up with SWIFT again.<p>This is the part that a private blockchain makes easy. You have banks or other private parties that all benefit from running a low-cost distributed ledger, they can firewall this off from the open internet, and all of them just have an interest in keeping the system going as-is at a low cost.<p>It&#x27;s easy to monitor whether some party is breaking the basic rules of mining, and once you have that setup adding new banks becomes a much easier lower-trust operation than e.g. giving some random new bank read-write access to your traditional RDBMs SWIFT replacement.",
  "time" : 1496050661,
  "type" : "comment"
}
