{
  "by" : "avar",
  "id" : 15117157,
  "kids" : [ 15123228 ],
  "parent" : 15116743,
  "text" : "<p><pre><code>    &gt; s&#x2F;FDA&#x2F;regulatory agency with similar standards as the FDA&#x2F;\n</code></pre>\nThat&#x27;s more reasonable but not the argument the article is making, which could be paraphrased as &quot;it&#x27;s not being done the way we do it in the US, so it must be bad&quot;.<p><pre><code>    &gt; it&#x27;s sketchy as hell to have a drug that&#x27;s\n    &gt; likely intended to be marketed in the US\n    &gt; not clinically trialed in the US or[...]\n</code></pre>\nYou can&#x27;t trial a drug in some supposed banana republic and then market it in the US. Here&#x27;s a nice overview of the hurdles the FDA puts on foreign-developed drugs, even those from mature developed markets like the EU and Australia: <a href=\"http:&#x2F;&#x2F;healthaffairs.org&#x2F;blog&#x2F;2014&#x2F;02&#x2F;14&#x2F;if-a-drug-is-good-enough-for-europeans-its-good-enough-for-us&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;healthaffairs.org&#x2F;blog&#x2F;2014&#x2F;02&#x2F;14&#x2F;if-a-drug-is-good-e...</a><p>So the concern is not that FDA rules are being evaded for the purposes of marketing to US consumers, but rather that someone&#x27;s running preliminary medical trials outside of the US. Presumably to test basic viability, or perhaps to initially target markets in other countries than the US.<p><pre><code>    &gt; This could kill, and it&#x27;s unethical to\n    &gt; attempt to sidestep strong protections[...]\n</code></pre>\nHerpes is already killing hundreds (if not thousands) annually, although it seems nobody has good numbers on this as the countries disproportionately affected are usually really poor [1][2][3].<p><pre><code>    &gt; [...]for the sake of some minimal extra cash.\n</code></pre>\nA lot has been written about how insanely expensive medical research is these days, and how big drug companies tend to focus on expensive drugs they can keep selling you at the cost of something like vaccines.<p>It&#x27;s pretty telling that we&#x27;re talking about Peter Thiel funding Herpes vaccine development at all, the fact that he&#x27;s not a joke in that space being out-competed by big pharmaceutical companies should tell you something.<p>So this supposed trolley problem of &quot;if we allow cheap research people might die&quot; becomes less clear. People are dying right now, and apparently basic research to solve that problem has become too expensive for anyone to bother in major developed nations like the US and EU.<p>1. <a href=\"http:&#x2F;&#x2F;www.sciencedirect.com&#x2F;science&#x2F;article&#x2F;pii&#x2F;S0022347615002516\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sciencedirect.com&#x2F;science&#x2F;article&#x2F;pii&#x2F;S0022347615...</a><p>2. <a href=\"http:&#x2F;&#x2F;www.who.int&#x2F;reproductivehealth&#x2F;topics&#x2F;maternal_perinatal&#x2F;estimates-neonatal-herpes-cases&#x2F;en&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.who.int&#x2F;reproductivehealth&#x2F;topics&#x2F;maternal_perina...</a><p>3. <a href=\"https:&#x2F;&#x2F;www.ncbi.nlm.nih.gov&#x2F;pubmed&#x2F;28153513\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ncbi.nlm.nih.gov&#x2F;pubmed&#x2F;28153513</a>",
  "time" : 1503933942,
  "type" : "comment"
}
