{
  "by" : "avar",
  "id" : 15127505,
  "parent" : 15123228,
  "text" : "<p><pre><code>    &gt; [...]they are end-running around FDA\n    &gt; equivalent rules to get a sketchy study\n    &gt; done[...].\n</code></pre>\nI haven&#x27;t read anything to suggest that they research being done there is actually sketchy, just that people are complaining about the lack of US oversight. There&#x27;s quotes in the article to the effect that all appropriate safety precautions are being taken, and no suggestion that the actual activities in St. Kitts are sketchy in in of themselves.<p>Of course that&#x27;s harder to ascertain without an IRB, but given Thiel&#x27;s politics I&#x27;d be just as willing to believe that this is all on the up &amp; up and he&#x27;s just giving the FDA the middle finger out of some libertarian grandstanding as the possibility that he&#x27;s running some offshore Mengelean medical lab.<p><pre><code>    &gt; [...]so they can market it somewhere with lax\n    &gt; rules.\n</code></pre>\nThat was just a throwaway theory of mine as to what they could be doing, they could also just be trying to save money in phase 1 trials on what they see as a needless bureaucracy.<p><pre><code>    &gt; That&#x27;s not exactly ethical[...]\n</code></pre>\nI think this entire line of thinking, aside from this specific case, is highly arrogant and US-centric. You&#x27;re assuming that more regulation is automatically an improvement, and that e.g. India, China, Saint Kitts and Nevis or some other country is inherently incapable of running ethical medical trials just because they aren&#x27;t doing it as some &quot;the FDA&#x27;s way or the highway&quot; cheerleaders think they should be doing it.<p>If they&#x27;re actually doing something unethical that behavior warrants criticism. The line of argument that the US needs to be involved in everything is fallacious.<p><pre><code>    &gt; People don&#x27;t die from genital herpes.\n</code></pre>\nYes they do. Unless you don&#x27;t consider newborns people. Maternal genital herpes transmitted at birth is the primary cause of neonatal herpes simplex, which can be fatal. A herpes vaccine could eliminate this transmission vector and save lives.<p>Whether Thiel or his supposedly sketchy research comes up with that vaccine is another matter.<p><pre><code>    &gt; sending people to a wild west\n    &gt; jurisdiction like St Kitts\n</code></pre>\nMy main beef with this article is the lazy journalism, and its assumption (and seemingly yours too) that St. Kitts is some wild-west jurisdiction allowing unethical medical trials.<p>Maybe that&#x27;s the case, but e.g. some quick googling finds that there&#x27;s a medical school there[1], it seems lazy in the extreme to not e.g. contact them, or someone from the St. Kitts government to get their take on this. We&#x27;re just left with something that seems like lazy hit-piece.<p><pre><code>    &gt; [...]not undergoing peer-review.\n</code></pre>\nPeer-review would happen once they&#x27;re ready to publish something in a medical journal would it not? The supposedly unethical behavior here is that they&#x27;re not volunteering to US-style oversight.<p>1. <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Windsor_University_School_of_Medicine\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Windsor_University_School_of_M...</a>",
  "time" : 1504039884,
  "type" : "comment"
}
