{
  "by" : "avar",
  "id" : 1519094,
  "parent" : 1518754,
  "text" : "For some historical context: The debate over whether using the\npublicly advertised functions of a GPL library makes your code GPL too\nis an old one, the best and early example of this was the CLISP\nv.s. FSF debate, which the FSF won:\n<a href=\"http://clisp.cvs.sourceforge.net/viewvc/clisp/clisp/doc/Why-CLISP-is-under-GPL\" rel=\"nofollow\">http://clisp.cvs.sourceforge.net/viewvc/clisp/clisp/doc/Why-...</a>\nin particular Stallman said:<p><pre><code>    I say this [that using the readline API makes your code GPL too]\n    based on discussions I had with our lawyer long ago.  The issue\n    first arose when NeXT proposed to distribute a modified GCC in two\n    parts and let the user link them.  Jobs asked me whether this was\n    lawful.  It seemed to me at the time that it was, following\n    reasoning like what you are using; but since the result was very\n    undesirable for free software, I said I would have to ask the\n    lawyer.\n    \n    What the lawyer said surprised me; he said that judges would\n    consider such schemes to be \"subterfuges\" and would be very harsh\n    toward them.  He said a judge would ask whether it is \"really\" one\n    program, rather than how it is labeled.\n</code></pre>\nLater, Linux under the direction of Linus Torvalds did the opposite\nthe other way by looking the other way when nVIDIA and others\ndistributed binary blobs that directly interfaced with the\nkernel. Some people now point to this as an example of why this sort\nof thing is just fine by the GPL, but in fact it's a very grey\narea. It's likely that if the Linux kernel had been run by the FSF\nthat nVIDIA's actions would have resulted in a lawsuit.<p>However, as pointed out by others this doesn't appear to be a case of\nusing a public GPL API at all, but rather case of code being\ncopied. See\n<a href=\"http://drewblas.com/2010/07/15/an-analysis-of-gpled-code-in-thesis/\" rel=\"nofollow\">http://drewblas.com/2010/07/15/an-analysis-of-gpled-code-in-...</a>\nspecifically this comparison:\n<a href=\"http://drewblas.files.wordpress.com/2010/07/diff.png\" rel=\"nofollow\">http://drewblas.files.wordpress.com/2010/07/diff.png</a>",
  "time" : 1279226366,
  "type" : "comment"
}
