{
  "by" : "avar",
  "id" : 15515821,
  "kids" : [ 15517051, 15516107, 15516224, 15517900, 15517106, 15516348, 15516097, 15517136, 15516969, 15516031, 15516506, 15518111, 15515977, 15520344, 15521157, 15519624, 15516241, 15521148, 15519229, 15519932 ],
  "parent" : 15515292,
  "text" : "For reasons I won&#x27;t go into the farming lobby is really strong in Iceland.<p>Sheep run free-range around the entire island, if you&#x27;d like to grow something that sheep like to eat you need to fence it in. It&#x27;s not like pretty much anywhere else in the western world where people who own grazing animals need to fence them in.<p>Thus the sheep range far and wide and destroy Iceland&#x27;s native low-lying forests. Iceland&#x27;s native crooked birch hasn&#x27;t developed resistance to grazing animals as mainland trees had to do, the sheep love to nibble at them and eat the seedlings.<p>The native trees and other native vegetation are generally much hardier than the foreign plants. But since the forestry service has lost the battle with the farming lobby they&#x27;re desperately trying to introduce some trees that the sheep won&#x27;t eat.<p>Reforesting the country is largely being done through subsidies to farmers, who aren&#x27;t concerned with topsoil preservation beyond maintaining the desolate landscape they inherited, but they are interested in the eventual promise of a commercial forest on their land.<p>Which is something to keep in mind when reading articles like these and wondering &quot;why don&#x27;t they...&quot;, usually the answer is that they&#x27;re planting in a field that&#x27;s going to be full of grazing animals, and there&#x27;s no way the forestry service is going to win that battle anytime soon, or that they&#x27;re not really aiming to restore the topsoil per-se, but to do that as a side-effect of commercial logging.<p>This page has some more details: <a href=\"http:&#x2F;&#x2F;www.skogur.is&#x2F;english&#x2F;forestry-in-a-treeless-land&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.skogur.is&#x2F;english&#x2F;forestry-in-a-treeless-land&#x2F;</a>",
  "time" : 1508508208,
  "type" : "comment"
}
