{
  "by" : "avar",
  "id" : 15517516,
  "kids" : [ 15517934, 15520058 ],
  "parent" : 15517051,
  "text" : "The tl;dr of Iceland&#x27;s colonization is: Norse settlers arrive, placement in society is based on how big of a farmer you are. Thus they overgraze and unlike their native Scandinavia they&#x27;re doing this on a volcanic island with really thin topsoil, so the overgrazing leads to runaway topsoil erosion and dustbowlification. This leads to desperate logging of the last of the trees around for firewood and housing.<p>It&#x27;s never remotely recovered, but that process is slowly starting just now. I was trying to find a photo like the one you just posted but couldn&#x27;t. There&#x27;s lots of examples like that where the plant biodiversity in an area where the sheep can&#x27;t get to is night &amp; day compared to the area right next to it where they can.<p>Which is not to say that those specific trees are old growth forest or anything like that. Icelanders pretty much lived in mud huts until after WWII in large parts of the country. If the sheep didn&#x27;t get to a place like that some guy would have certainly swam over there to gather firewood. But it&#x27;ll have been left alone by sheep and man in the last several decades, which as you can see makes a huge difference.<p>Edit: Here&#x27;s an even more stunning photo of an island in the middle of a river that because of the depth of the river has been left alone by both man &amp; grazers: <a href=\"http:&#x2F;&#x2F;www.skogur.is&#x2F;media&#x2F;frettir-2014&#x2F;myndasafn-storar&#x2F;Videy-i-Thjorsa.jpg\" rel=\"nofollow\">http:&#x2F;&#x2F;www.skogur.is&#x2F;media&#x2F;frettir-2014&#x2F;myndasafn-storar&#x2F;Vid...</a><p>The accompanying article (in Icelandic, but it translates ok-ish) says that compared to the land around it it has a lot more biodiversity and a better topsoil, similar to other areas in the country protected from grazers that they&#x27;ve studied: <a href=\"http:&#x2F;&#x2F;www.skogur.is&#x2F;um-skograekt-rikisins&#x2F;vidburdir&#x2F;2014&#x2F;04&#x2F;25&#x2F;eventnr&#x2F;89\" rel=\"nofollow\">http:&#x2F;&#x2F;www.skogur.is&#x2F;um-skograekt-rikisins&#x2F;vidburdir&#x2F;2014&#x2F;04...</a>",
  "time" : 1508520292,
  "type" : "comment"
}
