{
  "by" : "avar",
  "id" : 15518658,
  "kids" : [ 15520248 ],
  "parent" : 15517900,
  "text" : "First of all you have to understand that private property in Scandinavia and Iceland works differently than it does in say the US. It&#x27;s more appropriately phrased as a &quot;limited land-use right&quot;, and the land use is always for a particular narrow purpose.<p>So for example, if you buy a farm and put a fence around it I&#x27;m still free to walk across your property to get to where I&#x27;m going, because farms are intended for farming, and as long as I&#x27;m not unduly interrupting that you have no standing to stop me. I can also set up a tent overnight on your farm as long as I don&#x27;t unduly bother you, i.e. set it up too close to your house, I need to pick up all my trash etc.<p>Now, back to your question. During the summer the sheep wander around and graze on any grass they can find, and due to precedence going back to colonization (where everyone who mattered was sheep farmer anyway) if you&#x27;d like them not to do that it&#x27;s your responsibility to set up a fence around your property, and of course the sheep are likely to start eating there first since sheep are lazy and go for the easy pickings first.<p>But this only applies to sheep, not e.g. cows, and that&#x27;s entirely to do with ongoing lobbying not just by the farming industry, but people in rural areas that hold disproportionate sway in parliament.<p>There are successful reforestation efforts going on in Iceland, but most of these are in park-like areas near municipalities. There&#x27;s not enough money being spent on this to fence wast swaths of land.<p>But yes, you could of course buy land, fence it off, and start planting trees on it. But that&#x27;s expensive and not very lucrative, so very few farmers are doing that to make money.<p>There are big national parks, but they&#x27;re almost all in areas that would be the last to regain any topsoil, i.e. in the highlands around glaciers.",
  "time" : 1508528814,
  "type" : "comment"
}
