{
  "by" : "avar",
  "id" : 1572661,
  "kids" : [ 1573231 ],
  "parent" : 1571613,
  "text" : "&#62; Sure, but that's no reason to be hostile to man pages.<p>They're not being hostile to man pages. They just don't maintain them. They're no more hostile to man pages than FreeBSD is to info pages.<p>&#62; Ideally you have a man page [...]<p>That doesn't sound very ideal. man pages and info pages are formatted differently and take a different approach to explaining things. Having both would mean that the maintainer of each package would need to expend effort on maintaining both.<p>As an example. Here's the FreeBSD strlen() manpage: <a href=\"http://www.gsp.com/cgi-bin/man.cgi?section=3&#38;topic=strlen\" rel=\"nofollow\">http://www.gsp.com/cgi-bin/man.cgi?section=3&#38;topic=strle...</a><p>And the equivalent section in the GNU libc manual: <a href=\"http://www.gnu.org/software/libc/manual/html_node/String-Length.html#String-Length\" rel=\"nofollow\">http://www.gnu.org/software/libc/manual/html_node/String-Len...</a><p>On FreeBSD I'd do `man 3 strlen' at the nearest terminal. On GNU I'd do `info libc' followed by `m string&#60;TAB&#62;' to find that node.<p>You can't easily turn that documentation into a man page. E.g. on FreeBSD you'd have one manual page for malloc(3), but in the libc manual the documentation for malloc and other allocation functions is part of an entire chapter on \"Virtual Memory Allocation And Paging\". You can't easily tear that out into a man page.<p>&#62; They could at least not stand in the way of those who would like to provide them.<p>Well, would the FreeBSD project stand in my way if I started sending them patches to duplicate their documentation in some new format like GNU info or perldoc? Probably yes.<p>Documentation isn't a one-off thing. It incurs a long-term maintenance cost. So it's best to pick one system and stick to it.<p>And really, it's not too much to ask that you just familiarize yourself with the conventions of the OS or system you're using. To stick to just ways of reading documentation I use man, info, perldoc, rdoc, phpdoc, javadoc, online tutorials etc. regularly.",
  "time" : 1280867772,
  "type" : "comment"
}
