{
  "by" : "avar",
  "id" : 3062845,
  "kids" : [ 3062908, 3062868, 3063508, 3064699, 3062918, 3063389, 3062923, 3063723, 3064700 ],
  "parent" : 3062517,
  "text" : "I'm running a Samsung Galaxy S2 that I've rooted. Here's my most commonly used applications, all of which I recommend:<p>* Smart Keyboard Pro: <a href=\"https://market.android.com/details?id=net.cdeguet.smartkeyboardpro\" rel=\"nofollow\">https://market.android.com/details?id=net.cdeguet.smartkeybo...</a> -- Allows me to use a Dvorak keyboard on the phone, but even if you don't use Dvorak it's still a great purchase. It has a lot of options to make your typing more efficient that the stock keyboard doesn't have.<p>* The Kindle app to read books. Now I mostly use it to read <i>.mobi files I've downloaded instead of buying things at the Amazon store, for which it works brilliantly. I wish it allowed copy/pasting of text though.<p></i> Google Reader for RSS/Atom<p>* GMail application for GMail.<p>* The stock Mail application for work IMAP, although I'll test out K-9 mentioned in this thread<p>* ColorNote for taking notes / shopping lists.<p>* live logcat for the novelty of having a l33t boot sequence (and getting rid of that annoying Samsung boot-up sound): <a href=\"https://market.android.com/details?id=eu.chainfire.livelogcat\" rel=\"nofollow\">https://market.android.com/details?id=eu.chainfire.livelogca...</a><p>* Root Explorer to manage root-only files.<p>* Skype to make video calls<p>* ConnectBot to ssh from the phone, although I haven't found out how to enable landscape mode in it, which is annoying.<p>* Listen for podcasts, although I haven't found out how to make it auto-download say the last 3 podcasts of everything I subscribe to.<p>* BBC News and Al Jazeera video for some world news<p>* Gh4a to browse GitHub<p>* AdFree to block spam<p>* Screenshot to take screenshots<p>* WolframAlpha for any sort of conversion / math queries.<p>* A PushUp / SitUp / Squats app (all separate apps) for managed stationary exercise. Although I'd like to find something that I could turn on and would give me instructions for a general N-minute workout that could be done at home.<p>Things I wish I didn't have to use, or don't know how to do, but haven't found out how to replace / do:<p>* The default Samsung camera application. There's no way to turn off the shutter noise on it, and it'll plain refuse to take pictures if the battery is low.<p>* The default task switcher, which often doesn't list the application I've just switched from (even though it's still open)<p>* The default system clipboard which doesn't seem to have a history / search feature like Emacs's kill ring.<p>* Having the default Samsung apps installed on the phone. I tried to use Titanium Backup PRO but it didn't work for removing or freezing them.<p>* Having something like Gesture search which searches across the entire phone but doesn't require me to draw on the screen, I just want to type a query.<p>* Sometimes the phone will go into some sort of voice command mode. I haven't found out how to disable it.<p>Lastly I plan to write an application that hooks into the \"Share\" handler for text/plain content and extracts the content of the clipboard, scans it for a URL, and pastes <i>that</i> to the clipboard.<p>I've found that quite a few apps have a \"Share\" functionality, but no \"copy the URL of what I'm looking at to the clipboard\", and I haven't found any existing app that works around this.",
  "time" : 1317563609,
  "type" : "comment"
}
