{
  "by" : "avar",
  "id" : 4261162,
  "kids" : [ 4261289, 4261271 ],
  "parent" : 4260964,
  "text" : "I wrote this a while ago (July last year) as <a href=\"http://goosegoosego.com\" rel=\"nofollow\">http://goosegoosego.com</a> whose source code is available at <a href=\"https://gist.github.com/1113894\" rel=\"nofollow\">https://gist.github.com/1113894</a><p>You missed a spot in your handling of bang syntax, DuckDuckGo allows you to use either \"\\\", \"! \" or \"!ducky \" to find the first result, you don't handle \"\\\".<p>At the time I also sent Gabriel Weinberg an couple of E-Mails about it saying I'd love to have it be made redundant by DuckDuckGo itself, but it's not a feature he's interested in pursuing:<p><pre><code>    &#62; &#62; &#62; On Sat, Jul 30, 2011 at 6:41 AM, Ævar Arnfjörð Bjarmason &#60;avarab@gmail.com&#62; wrote:\n    &#62; &#62; &#62; I implemented a wrapper around DuckDuckGo and Google and stuck it on\n    &#62; &#62; &#62; goosegoosego.com\n    &#62; &#62; &#62;\n    &#62; &#62; &#62; I got tired of always prefixing my normal queries with \"!g\", and not\n    &#62; &#62; &#62; having \"! \" work the way I wanted.\n    &#62; &#62; &#62;\n    &#62; &#62; On Sat, Jul 30, 2011 at 12:47, Gabriel Weinberg &#60;yegg@duckduckgo.com&#62; wrote:\n    &#62; &#62; &#62; Hah, nice :)\n    &#62; &#62; &#62; Gabriel, http://ye.gg/\n    &#62;\n    &#62; Needless to say I'd be delighted if some option to duckduckgo.com\n    &#62; would make this redundant.\n    &#62;\n    &#62; One flaw in it is that if you e.g. search for \"!mysql\" it'll redirect\n    &#62; to duck-duck-go, which'll do a \"site:mysql.com\" search an DDG.\n    &#62;\n    &#62; I'd like it to do a \"site:\" search on Google instead, but that would\n    &#62; require me to compile a list of all the bang operators that result in\n    &#62; site: queries, which would make the code a bit more complex than it\n    &#62; currently is.\n    &#62;\n    &#62; It would be great if you could pass some GET parameter to DDG to make\n    &#62; it emulate GooseGooseGo's behavior, e.g.:\n    &#62;\n    &#62;     http://duckduckgo.com/?dse=google&#38;q=foobar\n    &#62;\n    &#62; dse = Default Search Engine.\n    &#62;\n    &#62; Then you could also make it prefer Bing, Yahoo etc.\n\n    Duly noted, but not sure about doing that. Alternatively, you can\n    use the 0-click api at http://api.duckduckgo.com/, which returns\n    bang redirects and then you can just do a substitution if you see\n    that.\n\n    Gabriel, http://ye.gg/\n</code></pre>\nSo handling stuff like !mysql is certainly something you could expand upon if you want to make this more complete, I was just interested in making mine as minimal as possible, so it's a simple standalone script.<p>Also, to anyone using DuckDuckGoog or my GooseGooseGo you should be aware that you're trusting some (other) random dudes on the internet with your searches, I don't log <i>anything</i> with GooseGooseGo (no access or error logs), but you only have my word for that.<p>You can expose some sensitive information via your searches, and that's a reason why many people use DuckDuckGo in the first place even though their results aren't always up to par with Google's.",
  "time" : 1342624959,
  "type" : "comment"
}
