{
  "by" : "avar",
  "id" : 6137519,
  "kids" : [ 6137990, 6137547, 6140674, 6137741, 6139161, 6137718, 6139532, 6138745, 6139622, 6139555 ],
  "parent" : 6137259,
  "text" : "It&#x27;s interesting that someone who professes loving to program in Perl refers to it as &quot;PERL&quot;. People who refer to it in all-caps instantly give themselves away as outsiders to the language. It&#x27;s like someone claiming to be a senior JAVA programmer, it&#x27;s not an acronym.<p>Anyway we use Perl pretty much exclusively at Booking.com, and I&#x27;m pretty sure we&#x27;re at least a couple of orders of magnitude bigger than the likes of Crowdtilt. There&#x27;s a bunch of other interesting companies using Perl as well, a lot of them just don&#x27;t make as much of a fuss about it as the companies using say Ruby.<p>Last I knew e.g. Morgan Stanley used it for most everything, including new developments, and it alone probably employs more programmers using it than the combined hobbyist contributor base of some newer emerging languages.<p>It&#x27;s pretty hard to claim that Perl is &quot;dead&quot; and square that with the ongoing activity on the CPAN (<a href=\"https://metacpan.org/recent\" rel=\"nofollow\">https:&#x2F;&#x2F;metacpan.org&#x2F;recent</a>). This is not the kind of activity a dead language gets.<p>I think what a lot of people mix up is that just because something isn&#x27;t as big as it was before doesn&#x27;t mean it&#x27;s dead.<p>C isn&#x27;t as big relatively as it was in the 80s, Perl isn&#x27;t relatively as ubiquitous for scripting and web development as it was in the 90s, but neither of those languages are dead.<p>If you look at the total amount of contributions &#x2F; software written for any of the languages that aren&#x27;t currently in the spotlight you&#x27;ll most likely find that we&#x27;re at the high water mark of the number of the amount of software written in them, and the number of people that have been employed to write software in them, just because the industry as a whole is getting bigger every day.<p>Maybe they&#x27;re not bigger <i>relatively</i> compared to some other languages. But that has little bearing on how good they are when it comes to using them in your toolchain. If anything they&#x27;re better than they&#x27;ve ever been before.",
  "time" : 1375312905,
  "type" : "comment"
}
