{
  "by" : "avar",
  "id" : 8753555,
  "parent" : 8753055,
  "text" : "<p><pre><code>    &gt; Older people and disabled people make up a measured percentage\n    &gt; as well. So less than 90%.\n</code></pre>\nHow does being older have anything to do with needing more leg room?\nDepending on the disability that may not matter either.<p><pre><code>    &gt; Additionally everyone benefits from more seat pitch\n</code></pre>\nAs an anecdote I&#x27;m 183 cm (or 6&quot;) and I actually find it really\nuncomfortable to sit at the optional incline offered by airlines, I&#x27;d\nlike to either be sitting straight up or lie completely level, nothing\nin-between. So I&#x27;m not benefiting from it, unless it&#x27;s getting quite\nclose to 90 degrees.<p><pre><code>    &gt; It has nothing to do with &quot;comfort. [...] It is what people need\n    &gt; so they aren&#x27;t in physical pain for the duration of the flight.\n</code></pre>\nI&#x27;m relatively fine with the current seat arrangement, and I&#x27;m happy\nthat airlines aren&#x27;t being mandated to increase prices for everyone\ndue to some government-imposed seat size regulations.<p>I&#x27;m happy that I have the option to choose airlines like EasyJet for\nshorter trips which are essentially glorified cattle carts with wings\non them, but which would allow me to affordably go somewhere over a\nweekend. If I want more seat space there&#x27;s always something like KLM&#x27;s\nEconomy+, or other similar premium arrangements.<p><pre><code>    &gt; If airlines want to save some money, remove recline completely.\n</code></pre>\nAside from the fact that you&#x27;re entering into a voluntary business\narrangement with the airline, and it&#x27;s somewhat presumptuous to assume\nthat you&#x27;re better aware of how they could save money than they are:<p>When you&#x27;re sitting down in a chair your upper body isn&#x27;t taking up\nvolume in the space going up vertically from your knees, so there&#x27;s\nspace for the seat in front of you to recline into that space.<p>So this suggestion doesn&#x27;t make sense. It&#x27;s not an either-or, maybe\nairlines would benefit from removing or reducing recline, but that&#x27;s\nnot mutually exclusive with saving money by reducing the space between\nseats.",
  "time" : 1418669237,
  "type" : "comment"
}
